tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "jesseduffield/lazygit"
tap "ngrok/ngrok"
# AST-based pattern checker for JavaScript
brew "eslint"
# GitHub command-line tool
brew "gh"
# Improved top (interactive process viewer)
brew "htop"
# Powerful, lightweight programming language
brew "lua"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Opinionated Lua code formatter
brew "stylua"
# Terminal multiplexer
brew "tmux"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Application launcher and productivity software
cask "alfred"
# Reimagine your terminal
cask "fig"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Sandbox construction video game
cask "minecraft"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
